espressif/esp-idf/components/soc/esp32h2/register/soc/i2s_reg.h
/** I2S_RX_CLKM_CONF_REG register
 *  I2S RX clock configure register
 */
#define I2S_RX_CLKM_CONF_REG (DR_REG_I2S_BASE + 0x30)
/** I2S_RX_CLKM_DIV_NUM : R/W; bitpos: [7:0]; default: 2;
 *  Integral I2S clock divider value
 */
#define I2S_RX_CLKM_DIV_NUM    0x000000FFU
#define I2S_RX_CLKM_DIV_NUM_M  (I2S_RX_CLKM_DIV_NUM_V << I2S_RX_CLKM_DIV_NUM_S)
#define I2S_RX_CLKM_DIV_NUM_V  0x000000FFU
#define I2S_RX_CLKM_DIV_NUM_S  0
/** I2S_RX_CLK_ACTIVE : R/W; bitpos: [26]; default: 0;
 *  I2S Rx module clock enable signal.
 */
#define I2S_RX_CLK_ACTIVE    (BIT(26))
#define I2S_RX_CLK_ACTIVE_M  (I2S_RX_CLK_ACTIVE_V << I2S_RX_CLK_ACTIVE_S)
#define I2S_RX_CLK_ACTIVE_V  0x00000001U
#define I2S_RX_CLK_ACTIVE_S  26
/** I2S_RX_CLK_SEL : R/W; bitpos: [28:27]; default: 0;
 *  Select I2S Rx module source clock. 0: no clock. 1: APLL. 2: CLK160. 3: I2S_MCLK_in.
 */
#define I2S_RX_CLK_SEL    0x00000003U
#define I2S_RX_CLK_SEL_M  (I2S_RX_CLK_SEL_V << I2S_RX_CLK_SEL_S)
#define I2S_RX_CLK_SEL_V  0x00000003U
#define I2S_RX_CLK_SEL_S  27
/** I2S_MCLK_SEL : R/W; bitpos: [29]; default: 0;
 *  0: UseI2S Tx module clock as I2S_MCLK_OUT.  1: UseI2S Rx module clock as
 *  I2S_MCLK_OUT.
 */
#define I2S_MCLK_SEL    (BIT(29))
#define I2S_MCLK_SEL_M  (I2S_MCLK_SEL_V << I2S_MCLK_SEL_S)
#define I2S_MCLK_SEL_V  0x00000001U
#define I2S_MCLK_SEL_S  29

/** I2S_TX_CLKM_CONF_REG register
 *  I2S TX clock configure register
 */
#define I2S_TX_CLKM_CONF_REG (DR_REG_I2S_BASE + 0x34)
/** I2S_TX_CLKM_DIV_NUM : R/W; bitpos: [7:0]; default: 2;
 *  Integral I2S TX clock divider value. f_I2S_CLK = f_I2S_CLK_S/(N+b/a). There will be
 *  (a-b) * n-div and b * (n+1)-div.  So the average combination will be:  for b <=
 *  a/2, z * [x * n-div + (n+1)-div] + y * n-div. For b > a/2, z * [n-div + x *
 *  (n+1)-div] + y * (n+1)-div.
 */
#define I2S_TX_CLKM_DIV_NUM    0x000000FFU
#define I2S_TX_CLKM_DIV_NUM_M  (I2S_TX_CLKM_DIV_NUM_V << I2S_TX_CLKM_DIV_NUM_S)
#define I2S_TX_CLKM_DIV_NUM_V  0x000000FFU
#define I2S_TX_CLKM_DIV_NUM_S  0
/** I2S_TX_CLK_ACTIVE : R/W; bitpos: [26]; default: 0;
 *  I2S Tx module clock enable signal.
 */
#define I2S_TX_CLK_ACTIVE    (BIT(26))
#define I2S_TX_CLK_ACTIVE_M  (I2S_TX_CLK_ACTIVE_V << I2S_TX_CLK_ACTIVE_S)
#define I2S_TX_CLK_ACTIVE_V  0x00000001U
#define I2S_TX_CLK_ACTIVE_S  26
/** I2S_TX_CLK_SEL : R/W; bitpos: [28:27]; default: 0;
 *  Select I2S Tx module source clock. 0: XTAL clock. 1: APLL. 2: CLK160. 3:
 *  I2S_MCLK_in.
 */
#define I2S_TX_CLK_SEL    0x00000003U
#define I2S_TX_CLK_SEL_M  (I2S_TX_CLK_SEL_V << I2S_TX_CLK_SEL_S)
#define I2S_TX_CLK_SEL_V  0x00000003U
#define I2S_TX_CLK_SEL_S  27
/** I2S_CLK_EN : R/W; bitpos: [29]; default: 0;
 *  Set this bit to enable clk gate
 */
#define I2S_CLK_EN    (BIT(29))
#define I2S_CLK_EN_M  (I2S_CLK_EN_V << I2S_CLK_EN_S)
#define I2S_CLK_EN_V  0x00000001U
#define I2S_CLK_EN_S  29

/** I2S_RX_CLKM_DIV_CONF_REG register
 *  I2S RX module clock divider configure register
 */
#define I2S_RX_CLKM_DIV_CONF_REG (DR_REG_I2S_BASE + 0x38)
/** I2S_RX_CLKM_DIV_Z : R/W; bitpos: [8:0]; default: 0;
 *  For b <= a/2, the value of I2S_RX_CLKM_DIV_Z is b. For b > a/2, the value of
 *  I2S_RX_CLKM_DIV_Z is (a-b).
 */
#define I2S_RX_CLKM_DIV_Z    0x000001FFU
#define I2S_RX_CLKM_DIV_Z_M  (I2S_RX_CLKM_DIV_Z_V << I2S_RX_CLKM_DIV_Z_S)
#define I2S_RX_CLKM_DIV_Z_V  0x000001FFU
#define I2S_RX_CLKM_DIV_Z_S  0
/** I2S_RX_CLKM_DIV_Y : R/W; bitpos: [17:9]; default: 1;
 *  For b <= a/2, the value of I2S_RX_CLKM_DIV_Y is (a%b) . For b > a/2, the value of
 *  I2S_RX_CLKM_DIV_Y is (a%(a-b)).
 */
#define I2S_RX_CLKM_DIV_Y    0x000001FFU
#define I2S_RX_CLKM_DIV_Y_M  (I2S_RX_CLKM_DIV_Y_V << I2S_RX_CLKM_DIV_Y_S)
#define I2S_RX_CLKM_DIV_Y_V  0x000001FFU
#define I2S_RX_CLKM_DIV_Y_S  9
/** I2S_RX_CLKM_DIV_X : R/W; bitpos: [26:18]; default: 0;
 *  For b <= a/2, the value of I2S_RX_CLKM_DIV_X is (a/b) - 1. For b > a/2, the value
 *  of I2S_RX_CLKM_DIV_X is (a/(a-b)) - 1.
 */
#define I2S_RX_CLKM_DIV_X    0x000001FFU
#define I2S_RX_CLKM_DIV_X_M  (I2S_RX_CLKM_DIV_X_V << I2S_RX_CLKM_DIV_X_S)
#define I2S_RX_CLKM_DIV_X_V  0x000001FFU
#define I2S_RX_CLKM_DIV_X_S  18
/** I2S_RX_CLKM_DIV_YN1 : R/W; bitpos: [27]; default: 0;
 *  For b <= a/2, the value of I2S_RX_CLKM_DIV_YN1 is 0 . For b > a/2, the value of
 *  I2S_RX_CLKM_DIV_YN1 is 1.
 */
#define I2S_RX_CLKM_DIV_YN1    (BIT(27))
#define I2S_RX_CLKM_DIV_YN1_M  (I2S_RX_CLKM_DIV_YN1_V << I2S_RX_CLKM_DIV_YN1_S)
#define I2S_RX_CLKM_DIV_YN1_V  0x00000001U
#define I2S_RX_CLKM_DIV_YN1_S  27

/** I2S_TX_CLKM_DIV_CONF_REG register
 *  I2S TX module clock divider configure register
 */
#define I2S_TX_CLKM_DIV_CONF_REG (DR_REG_I2S_BASE + 0x3c)
/** I2S_TX_CLKM_DIV_Z : R/W; bitpos: [8:0]; default: 0;
 *  For b <= a/2, the value of I2S_TX_CLKM_DIV_Z is b. For b > a/2, the value of
 *  I2S_TX_CLKM_DIV_Z is (a-b).
 */
#define I2S_TX_CLKM_DIV_Z    0x000001FFU
#define I2S_TX_CLKM_DIV_Z_M  (I2S_TX_CLKM_DIV_Z_V << I2S_TX_CLKM_DIV_Z_S)
#define I2S_TX_CLKM_DIV_Z_V  0x000001FFU
#define I2S_TX_CLKM_DIV_Z_S  0
/** I2S_TX_CLKM_DIV_Y : R/W; bitpos: [17:9]; default: 1;
 *  For b <= a/2, the value of I2S_TX_CLKM_DIV_Y is (a%b) . For b > a/2, the value of
 *  I2S_TX_CLKM_DIV_Y is (a%(a-b)).
 */
#define I2S_TX_CLKM_DIV_Y    0x000001FFU
#define I2S_TX_CLKM_DIV_Y_M  (I2S_TX_CLKM_DIV_Y_V << I2S_TX_CLKM_DIV_Y_S)
#define I2S_TX_CLKM_DIV_Y_V  0x000001FFU
#define I2S_TX_CLKM_DIV_Y_S  9
/** I2S_TX_CLKM_DIV_X : R/W; bitpos: [26:18]; default: 0;
 *  For b <= a/2, the value of I2S_TX_CLKM_DIV_X is (a/b) - 1. For b > a/2, the value
 *  of I2S_TX_CLKM_DIV_X is (a/(a-b)) - 1.
 */
#define I2S_TX_CLKM_DIV_X    0x000001FFU
#define I2S_TX_CLKM_DIV_X_M  (I2S_TX_CLKM_DIV_X_V << I2S_TX_CLKM_DIV_X_S)
#define I2S_TX_CLKM_DIV_X_V  0x000001FFU
#define I2S_TX_CLKM_DIV_X_S  18
/** I2S_TX_CLKM_DIV_YN1 : R/W; bitpos: [27]; default: 0;
 *  For b <= a/2, the value of I2S_TX_CLKM_DIV_YN1 is 0 . For b > a/2, the value of
 *  I2S_TX_CLKM_DIV_YN1 is 1.
 */
#define I2S_TX_CLKM_DIV_YN1    (BIT(27))
#define I2S_TX_CLKM_DIV_YN1_M  (I2S_TX_CLKM_DIV_YN1_V << I2S_TX_CLKM_DIV_YN1_S)
#define I2S_TX_CLKM_DIV_YN1_V  0x00000001U
#define I2S_TX_CLKM_DIV_YN1_S  27

/** I2S_TX_PCM2PDM_CONF_REG register
 *  I2S TX PCM2PDM configuration register
 */
#define I2S_TX_PCM2PDM_CONF_REG (DR_REG_I2S_BASE + 0x40)
/** I2S_TX_PDM_HP_BYPASS : R/W; bitpos: [0]; default: 0;
 *  I2S TX PDM bypass hp filter or not. The option has been removed.
 */
#define I2S_TX_PDM_HP_BYPASS    (BIT(0))
#define I2S_TX_PDM_HP_BYPASS_M  (I2S_TX_PDM_HP_BYPASS_V << I2S_TX_PDM_HP_BYPASS_S)
#define I2S_TX_PDM_HP_BYPASS_V  0x00000001U
#define I2S_TX_PDM_HP_BYPASS_S  0
/** I2S_TX_PDM_SINC_OSR2 : R/W; bitpos: [4:1]; default: 2;
 *  I2S TX PDM OSR2 value
 */
#define I2S_TX_PDM_SINC_OSR2    0x0000000FU
#define I2S_TX_PDM_SINC_OSR2_M  (I2S_TX_PDM_SINC_OSR2_V << I2S_TX_PDM_SINC_OSR2_S)
#define I2S_TX_PDM_SINC_OSR2_V  0x0000000FU
#define I2S_TX_PDM_SINC_OSR2_S  1
/** I2S_TX_PDM_PRESCALE : R/W; bitpos: [12:5]; default: 0;
 *  I2S TX PDM prescale for sigmadelta
 */
#define I2S_TX_PDM_PRESCALE    0x000000FFU
#define I2S_TX_PDM_PRESCALE_M  (I2S_TX_PDM_PRESCALE_V << I2S_TX_PDM_PRESCALE_S)
#define I2S_TX_PDM_PRESCALE_V  0x000000FFU
#define I2S_TX_PDM_PRESCALE_S  5
/** I2S_TX_PDM_HP_IN_SHIFT : R/W; bitpos: [14:13]; default: 1;
 *  I2S TX PDM sigmadelta scale shift number: 0:/2 , 1:x1 , 2:x2 , 3: x4
 */
#define I2S_TX_PDM_HP_IN_SHIFT    0x00000003U
#define I2S_TX_PDM_HP_IN_SHIFT_M  (I2S_TX_PDM_HP_IN_SHIFT_V << I2S_TX_PDM_HP_IN_SHIFT_S)
#define I2S_TX_PDM_HP_IN_SHIFT_V  0x00000003U
#define I2S_TX_PDM_HP_IN_SHIFT_S  13
/** I2S_TX_PDM_LP_IN_SHIFT : R/W; bitpos: [16:15]; default: 1;
 *  I2S TX PDM sigmadelta scale shift number: 0:/2 , 1:x1 , 2:x2 , 3: x4
 */
#define I2S_TX_PDM_LP_IN_SHIFT    0x00000003U
#define I2S_TX_PDM_LP_IN_SHIFT_M  (I2S_TX_PDM_LP_IN_SHIFT_V << I2S_TX_PDM_LP_IN_SHIFT_S)
#define I2S_TX_PDM_LP_IN_SHIFT_V  0x00000003U
#define I2S_TX_PDM_LP_IN_SHIFT_S  15
/** I2S_TX_PDM_SINC_IN_SHIFT : R/W; bitpos: [18:17]; default: 1;
 *  I2S TX PDM sigmadelta scale shift number: 0:/2 , 1:x1 , 2:x2 , 3: x4
 */
#define I2S_TX_PDM_SINC_IN_SHIFT    0x00000003U
#define I2S_TX_PDM_SINC_IN_SHIFT_M  (I2S_TX_PDM_SINC_IN_SHIFT_V << I2S_TX_PDM_SINC_IN_SHIFT_S)
#define I2S_TX_PDM_SINC_IN_SHIFT_V  0x00000003U
#define I2S_TX_PDM_SINC_IN_SHIFT_S  17
/** I2S_TX_PDM_SIGMADELTA_IN_SHIFT : R/W; bitpos: [20:19]; default: 1;
 *  I2S TX PDM sigmadelta scale shift number: 0:/2 , 1:x1 , 2:x2 , 3: x4
 */
#define I2S_TX_PDM_SIGMADELTA_IN_SHIFT    0x00000003U
#define I2S_TX_PDM_SIGMADELTA_IN_SHIFT_M  (I2S_TX_PDM_SIGMADELTA_IN_SHIFT_V << I2S_TX_PDM_SIGMADELTA_IN_SHIFT_S)
#define I2S_TX_PDM_SIGMADELTA_IN_SHIFT_V  0x00000003U
#define I2S_TX_PDM_SIGMADELTA_IN_SHIFT_S  19
/** I2S_TX_PDM_SIGMADELTA_DITHER2 : R/W; bitpos: [21]; default: 0;
 *  I2S TX PDM sigmadelta dither2 value
 */
#define I2S_TX_PDM_SIGMADELTA_DITHER2    (BIT(21))
#define I2S_TX_PDM_SIGMADELTA_DITHER2_M  (I2S_TX_PDM_SIGMADELTA_DITHER2_V << I2S_TX_PDM_SIGMADELTA_DITHER2_S)
#define I2S_TX_PDM_SIGMADELTA_DITHER2_V  0x00000001U
#define I2S_TX_PDM_SIGMADELTA_DITHER2_S  21
/** I2S_TX_PDM_SIGMADELTA_DITHER : R/W; bitpos: [22]; default: 1;
 *  I2S TX PDM sigmadelta dither value
 */
#define I2S_TX_PDM_SIGMADELTA_DITHER    (BIT(22))
#define I2S_TX_PDM_SIGMADELTA_DITHER_M  (I2S_TX_PDM_SIGMADELTA_DITHER_V << I2S_TX_PDM_SIGMADELTA_DITHER_S)
#define I2S_TX_PDM_SIGMADELTA_DITHER_V  0x00000001U
#define I2S_TX_PDM_SIGMADELTA_DITHER_S  22
/** I2S_TX_PDM_DAC_2OUT_EN : R/W; bitpos: [23]; default: 0;
 *  I2S TX PDM dac mode enable
 */
#define I2S_TX_PDM_DAC_2OUT_EN    (BIT(23))
#define I2S_TX_PDM_DAC_2OUT_EN_M  (I2S_TX_PDM_DAC_2OUT_EN_V << I2S_TX_PDM_DAC_2OUT_EN_S)
#define I2S_TX_PDM_DAC_2OUT_EN_V  0x00000001U
#define I2S_TX_PDM_DAC_2OUT_EN_S  23
/** I2S_TX_PDM_DAC_MODE_EN : R/W; bitpos: [24]; default: 0;
 *  I2S TX PDM dac 2channel enable
 */
#define I2S_TX_PDM_DAC_MODE_EN    (BIT(24))
#define I2S_TX_PDM_DAC_MODE_EN_M  (I2S_TX_PDM_DAC_MODE_EN_V << I2S_TX_PDM_DAC_MODE_EN_S)
#define I2S_TX_PDM_DAC_MODE_EN_V  0x00000001U
#define I2S_TX_PDM_DAC_MODE_EN_S  24
/** I2S_PCM2PDM_CONV_EN : R/W; bitpos: [25]; default: 0;
 *  I2S TX PDM Converter enable
 */
#define I2S_PCM2PDM_CONV_EN    (BIT(25))
#define I2S_PCM2PDM_CONV_EN_M  (I2S_PCM2PDM_CONV_EN_V << I2S_PCM2PDM_CONV_EN_S)
#define I2S_PCM2PDM_CONV_EN_V  0x00000001U
#define I2S_PCM2PDM_CONV_EN_S  25

/** I2S_TX_PCM2PDM_CONF1_REG register
 *  I2S TX PCM2PDM configuration register
 */
#define I2S_TX_PCM2PDM_CONF1_REG (DR_REG_I2S_BASE + 0x44)
/** I2S_TX_PDM_FP : R/W; bitpos: [9:0]; default: 960;
 *  I2S TX PDM Fp
 */
#define I2S_TX_PDM_FP    0x000003FFU
#define I2S_TX_PDM_FP_M  (I2S_TX_PDM_FP_V << I2S_TX_PDM_FP_S)
#define I2S_TX_PDM_FP_V  0x000003FFU
#define I2S_TX_PDM_FP_S  0
/** I2S_TX_PDM_FS : R/W; bitpos: [19:10]; default: 480;
 *  I2S TX PDM Fs
 */
#define I2S_TX_PDM_FS    0x000003FFU
#define I2S_TX_PDM_FS_M  (I2S_TX_PDM_FS_V << I2S_TX_PDM_FS_S)
#define I2S_TX_PDM_FS_V  0x000003FFU
#define I2S_TX_PDM_FS_S  10
/** I2S_TX_IIR_HP_MULT12_5 : R/W; bitpos: [22:20]; default: 7;
 *  The fourth parameter of PDM TX IIR_HP filter stage 2 is (504 +
 *  I2S_TX_IIR_HP_MULT12_5[2:0])
 */
#define I2S_TX_IIR_HP_MULT12_5    0x00000007U
#define I2S_TX_IIR_HP_MULT12_5_M  (I2S_TX_IIR_HP_MULT12_5_V << I2S_TX_IIR_HP_MULT12_5_S)
#define I2S_TX_IIR_HP_MULT12_5_V  0x00000007U
#define I2S_TX_IIR_HP_MULT12_5_S  20
/** I2S_TX_IIR_HP_MULT12_0 : R/W; bitpos: [25:23]; default: 7;
 *  The fourth parameter of PDM TX IIR_HP filter stage 1 is (504 +
 *  I2S_TX_IIR_HP_MULT12_0[2:0])
 */
#define I2S_TX_IIR_HP_MULT12_0    0x00000007U
#define I2S_TX_IIR_HP_MULT12_0_M  (I2S_TX_IIR_HP_MULT12_0_V << I2S_TX_IIR_HP_MULT12_0_S)
#define I2S_TX_IIR_HP_MULT12_0_V  0x00000007U
#define I2S_TX_IIR_HP_MULT12_0_S  23

